In [39]:
pwd

'/Users/medamin/_Projets/_DataScience/backup_MLcourse'

In [4]:
import matplotlib.pyplot as plt
import numpy as np
import pandas as pd
import seaborn as sns
import timeit

# Load dataset
df = sns.load_dataset('titanic')

In [5]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 15 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   survived     891 non-null    int64
 1   pclass       891 non-null    int64
 2   sex          891 non-null    object
 3   age          714 non-null    float64
 4   sibsp        891 non-null    int64
 5   parch        891 non-null    int64
 6   fare         891 non-null    float64
 7   embarked     889 non-null    object
 8   class        891 non-null    category
 9   who          891 non-null    object
 10  adult_male   891 non-null    bool
 11  deck         203 non-null    category
 12  embark_town  889 non-null    object
 13  alive        891 non-null    object
 14  alone        891 non-null    bool
dtypes: bool(2), category(2), float64(2), int64(4), object(5)
memory usage: 80.6+ KB

In [6]:
df.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True

In [11]:
df.shape

(891, 15)

In [21]:
(df.isnull().sum()/df.shape[0]).sort_values(ascending=False)

deck           0.772166
age            0.198653
embark_town    0.002245
embarked       0.002245
alone          0.000000
alive          0.000000
adult_male     0.000000
who            0.000000
class          0.000000
fare           0.000000
parch          0.000000
sibsp          0.000000
sex            0.000000
pclass         0.000000
survived       0.000000
dtype: float64

In [25]:
df.isna().sum()

survived         0
pclass           0
sex              0
age            177
sibsp            0
parch            0
fare             0
embarked         2
class            0
who              0
adult_male       0
deck           688
embark_town      2
alive            0
alone            0
dtype: int64

In [24]:
pd.isnull

In [33]:
df.dropna(axis=0).shape #. .isna().sum()

(182, 15)

In [34]:
# just for demonstration. but it's not acceptable to sacrifice that much data
df.dropna(axis=0, inplace=True)

In [35]:
#add a new column category next to the age group. 
category = pd.cut(df.age,bins=[0,2,17,65,99],
                  labels=['Toddler/baby','Child','Adult','Elderly'])
df.insert(5,'Cat_Age',category)

In [37]:
df.sample(10)

,survived,pclass,sex,age,sibsp,Cat_Age,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
871,1,1,female,47.0,1,Adult,1,52.5542,S,First,woman,False,D,Southampton,yes,False
390,1,1,male,36.0,1,Adult,2,120.0000,S,First,man,True,B,Southampton,yes,False
195,1,1,female,58.0,0,Adult,0,146.5208,C,First,woman,False,B,Cherbourg,yes,True
11,1,1,female,58.0,0,Adult,0,26.5500,S,First,woman,False,C,Southampton,yes,True
621,1,1,male,42.0,1,Adult,0,52.5542,S,First,man,True,D,Southampton,yes,False
748,0,1,male,19.0,1,Adult,0,53.1000,S,First,man,True,D,Southampton,no,False
193,1,2,male,3.0,1,Child,1,26.0000,S,Second,child,False,F,Southampton,yes,False
310,1,1,female,24.0,0,Adult,0,83.1583,C,First,woman,False,C,Cherbourg,yes,True
741,0,1,male,36.0,1,Adult,0,78.8500,S,First,man,True,C,Southampton,no,False
337,1,1,female,41.0,0,Adult,0,134.5000,C,First,woman,False,E,Cherbourg,yes,True

In [38]:
# count. by. Age Category 
df.Cat_Age.value_counts()

Adult           160
Child            14
Toddler/baby      5
Elderly           3
Name: Cat_Age, dtype: int64